[{"id":9481,"date":"2018-02-26T00:00:00","date_gmt":"2018-02-26T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/mercer-to-host-shurden-lectures-on-religious-liberty-and-separation-of-church-and-state-in-atlanta-and-macon\/"},"modified":"2018-02-26T00:00:00","modified_gmt":"2018-02-26T00:00:00","slug":"mercer-to-host-shurden-lectures-on-religious-liberty-and-separation-of-church-and-state-in-atlanta-and-macon","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/mercer-to-host-shurden-lectures-on-religious-liberty-and-separation-of-church-and-state-in-atlanta-and-macon\/","title":{"rendered":"Mercer to Host Baptist Joint Committee&#x27;s Shurden Lectures on Religious Liberty and Separation of Church and State in Atlanta and Macon"},"content":{"rendered":"<p>ATLANTA\/MACON – Mercer will host the 2018 Walter B. and Kay W. Shurden Lectures on Religious Liberty and Separation of Church and State March 20-21 on the University&#x27;s Atlanta and Macon campuses. All three lectures are free and open to the public.<\/p>\n<p>This year&#x27;s lecturer is Dr. Charles C. Haynes, founding director of the Religious Freedom Center of the Newseum Institute in Washington, D.C. Haynes is best known for his work on First Amendment issues in American public life.<\/p>\n<p>Over the past two decades, he has been the principal organizer and drafter of consensus guidelines on religion and values in public schools, endorsed by a broad range of religious, civil liberties and educational organizations. &nbsp;<\/p>\n<p>Haynes&#x27; first lecture, titled “Liberty of conscience and the future of American democracy,” will be hosted by McAfee School of Theology March 20 at 11 a.m. in Cecil B. Day Hall Auditorium on the Atlanta campus.<\/p>\n<p>His second lecture, “Standing up for justice and freedom in an age of conflict and division,” will be hosted by the Roberts Department of Religion in the College of Liberal Arts March 21 at 10 a.m. in the Medical School Auditorium on the Macon campus. The first 125 students to attend will receive a free T-shirt from the Baptist Joint Committee.<\/p>\n<p>Haynes&#x27; final lecture, “From background to common ground: A First Amendment vision for religious liberty in public life,” will be hosted by Mercer Law School March 21 at 3:30 p.m. in the law school&#x27;s first-floor courtroom.<\/p>\n<p>Haynes is author or co-author of six books, including&nbsp;<em>First Freedoms: A Documentary History of First Amendment Rights in America<\/em>&nbsp;and&nbsp;<em>Finding Common Ground: A First Amendment Guide to Religion and Public Schools.<\/em>&nbsp;He is widely quoted in news magazines and major newspapers and is a frequent guest on television and radio. He has been profiled in the <em>Wall Street Journal<\/em> and on ABC&#x27;s “Evening News.”<\/p>\n<p>His recent honors include the Sanford N. McDonnell Lifetime Achievement Award from Character.org and the Mahatma Gandhi Award for the Advancement of Pluralism from the Hindu American Foundation.<\/p>\n<p>A founding board member of Character.org, Haynes also serves on the Steering Committee of the Campaign for the Civic Mission of Schools. He chairs the Committee on Religious Liberty founded by the National Council of Churches.&nbsp;<\/p>\n<p>He earned his bachelor&#x27;s degree from Emory University, master&#x27;s degree from Harvard Divinity School and a doctorate from Emory.<\/p>\n<p>In 2004, Dr. Walter B. Shurden and Dr. Kay W. Shurden of Macon made a gift to the Washington, D.C.-based Baptist Joint Committee for Religious Liberty (BJC) to establish an annual lectureship on the issues of religious liberty and separation of church and state.<\/p>\n<p>A nationally noted church historian, Dr. Walter B. Shurden is founding executive director of the Center for Baptist Studies and a minister-at-large for Mercer. He served at the University for almost 25 years as Callaway Professor of Christianity in the Roberts Department of Religion in the College of Liberal Arts. During 18 of those years, he served as chair of the department.<\/p>\n<p>Dr. Kay W. Shurden, a retired professor in the Department of Psychiatry and Behavioral Sciences in Mercer&#x27;s School of Medicine, is a noted author and maintains a practice in counseling and supervision.<\/p>\n<p>Designed to enhance the ministry and programs of the Baptist Joint Committee, the lectures are held at Mercer every three years and at another seminary, college or university the other years. The lecturers, selected by the executive director of the BJC, may be academicians, politicians, ministers, church historians, ethicists or activists.<\/p>\n<p><strong>About the Baptist Joint Committee<\/strong><\/p>\n<p>The Baptist Joint Committee for Religious Liberty is a leading voice in Washington, D.C., working to defend religious freedom and protect the institutional separation of church and state in the historic Baptist tradition. Founded in 1936, the BJC fights for religious liberty for all, knowing that a threat to anyone&#x27;s religious liberty is a threat to everyone&#x27;s religious liberty. Learn more at <a href=\"http:\/\/bjconline.org\/\">BJConline.org<\/a>.<\/p>\n\n\t\t<style type='text\/css'>\n\t\t\t#gallery-1 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-1 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 33%;\n\t\t\t}\n\t\t\t#gallery-1 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-1 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t\/* see gallery_shortcode() in wp-includes\/media.php *\/\n\t\t<\/style>\n\t\t<div id='gallery-1' class='gallery galleryid-9481 gallery-columns-3 gallery-size-thumbnail'><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\t<a href='http:\/\/munews.wpengine.com\/mercer-to-host-shurden-lectures-on-religious-liberty-and-separation-of-church-and-state-in-atlanta-and-macon\/haynes-preview\/'><img width=\"150\" height=\"150\" src=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Haynes-preview-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Haynes-preview-150x150.jpg 150w, http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Haynes-preview-130x130.jpg 130w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/a>\n\t\t\t<\/dt><\/dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon portrait'>\n\t\t\t\t<a href='http:\/\/munews.wpengine.com\/mercer-to-host-shurden-lectures-on-religious-liberty-and-separation-of-church-and-state-in-atlanta-and-macon\/haynes\/'><img width=\"150\" height=\"150\" src=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Haynes-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Haynes-150x150.jpg 150w, http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Haynes-130x130.jpg 130w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/a>\n\t\t\t<\/dt><\/dl>\n\t\t\t<br style='clear: both' \/>\n\t\t<\/div>\n\n","protected":false},"excerpt":{"rendered":"<p>Mercer will host the 2018 Walter B. and Kay W. Shurden Lectures on Religious Liberty and Separation of Church and State March 20-21 on the University’s Atlanta and Macon campuses. All three lectures are free and open to the public.<\/p>\n","protected":false},"author":33,"featured_media":9482,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8,15],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9481"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9481"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9481\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9482"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9481"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9461,"date":"2018-02-15T00:00:00","date_gmt":"2018-02-15T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/blsa-honored-as-regional-chapter-of-the-year\/"},"modified":"2018-02-15T00:00:00","modified_gmt":"2018-02-15T00:00:00","slug":"blsa-honored-as-regional-chapter-of-the-year","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/blsa-honored-as-regional-chapter-of-the-year\/","title":{"rendered":"Mercer Black Law Student Association Honored as Regional Small-Sized Chapter of the Year"},"content":{"rendered":"<p>Mercer&#x27;s Black Law Student Association (BLSA) chapter was honored as the Regional Small-Sized Chapter of the Year on Feb. 4 at the 47th Southern Region Black Law Student Association Convention in Birmingham, Alabama. Mercer&#x27;s chapter of BLSA was recognized for its outstanding contributions to the student body as well as the Macon community during 2017.<\/p>\n<p>Mercer BLSA was honored as Regional Small Chapter of the Year in 2016 and Regional Medium Chapter of the Year in 2017.<\/p>\n<p>“Having the distinct pleasure of winning chapter of the year for the third time in a row is representative of the work Mercer BLSA members put into the organization,” said BLSA President Aliayah Baaith. “Each and every year, our members strive to take our events, our community service and our overall voice to a new level in order to increase the number of culturally responsible black and minority attorneys who excel academically, succeed professionally and positively impact the community.&#8221;<\/p>\n<p>Mercer BLSA received this recognition among other BLSAs from law schools across the southern region, which includes Alabama, Florida, Georgia, Louisiana, Mississippi, North Carolina, Puerto Rico, South Carolina and Tennessee.<\/p>\n<p>“Being a part of the Black Law Students Association means being a servant to the students and the community. The wonderful board and general members work with great due diligence to make sure that we are living up to this creed,” said Vice President Conley Scott. “To be recognized as Small Chapter of the Year reassures and validates the membership&#x27;s hard work. Furthermore, it gives valuable input into our programming and allows us a sense of what is working and how we can make it better. We are surely honored to have received the award. I am proud of the board and all of the general membership for their dedication, sweat and tears that made obtaining this award possible.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mercer’s Black Law Student Association (BLSA) chapter was honored as the Regional Small-Sized Chapter of the Year on Feb. 4, 2018, at the 47th Southern Region Black Law Student Association Convention in Birmingham, Alabama. Mercer’s chapter of BLSA was recognized for its outstanding contributions to the student body as well as the Macon community during 2017.<\/p>\n","protected":false},"author":35,"featured_media":9462,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9461"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9461"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9461\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9462"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9461"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9461"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9461"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9370,"date":"2017-11-17T00:00:00","date_gmt":"2017-11-17T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/alumni-profile-judge-clyde-reese\/"},"modified":"2017-11-17T00:00:00","modified_gmt":"2017-11-17T00:00:00","slug":"alumni-profile-judge-clyde-reese","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/alumni-profile-judge-clyde-reese\/","title":{"rendered":"Failure is Not an Option for The Honorable Clyde L. Reese, III"},"content":{"rendered":"<p>Judge Reese, &#x27;96, took an untraditional path to becoming a judge. After completing his undergraduate degree, he worked in real estate until making the decision to go to law school at the age of 32. He had three small children at the time and wanted to provide better for them as a real estate closing attorney. He decided to attend Mercer Law because of its welcoming environment.<\/p>\n<p>“I was determined to be successful at it,” Judge Reese said. “I built an approach that failure was not an option.” And has not looked back since. He was able to continue being an engaged father to his children while treating law school as a full-time job, something he was gratified to be able to do. He is appreciative of the support of his family and Mercer Law School as he made his way to a law degree.<\/p>\n<p>Trekking down the path to becoming a judge was not a part of his initial plan. When he graduated, becoming a judge was not a defined career goal. He was working for Georgia Governor Nathan Deal when the opportunity presented itself to start the process to become a judge. While he began yet another successful life path he says that being a “new judge” was really the only thing that was new about him, as he brought a lot of experience and perspectives to the table.<\/p>\n<p>When reflecting on his career, Judge Reese feels rewarded and pleased with his work to provide safer environments for children brought into state care custody versus reducing the number of children in care at the Department of Human Services. At the Department of Community Health, he began to take interest in those in rural areas and their access to basic healthcare. He worked closely with the Office of Rural Health to help build recognition and awareness about the cause. He would love to see a push beyond healthcare into increased legal representation in the rural areas of our state.<\/p>\n<p>Judge Reese noted that he is very excited to have Cathy Cox as the dean of the Law School. “Since my time in Law School, the number of student applications and the job market has changed tremendously,” said Reese. He believes Dean Cox will help prepare Mercer Law students to face the world and be real problem solvers. Not only is it important to navigate law school, but also navigate the real world.<\/p>\n<p>While Judge Reese&#x27;s path is a hard one to replicate, he advises current students and recent graduates to look at things positively even when they don&#x27;t work out the way they wanted them to. “Your attained skills will be applied in ways that may be different than how you initially imagined. You never know what opportunities will present themselves to you, be ready to always present yourself positively,” says Judge Reese. Although he was not able to participate in many extracurricular activities; he was able to develop relationships with his classmates that will last a lifetime.<\/p>\n<p>He recalled a moment during law school when a certain professor, who most students were intimidated by, really supported him as he was called away for a family emergency. As a nontraditional student, he was glad he was not given special treatment for having a family and being at a different place in life, but it was times like those when Mercer provided compassion and really reinforced his choice in a law school like Mercer Law.<\/p>\n\n\t\t<style type='text\/css'>\n\t\t\t#gallery-2 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-2 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 33%;\n\t\t\t}\n\t\t\t#gallery-2 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-2 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t\/* see gallery_shortcode() in wp-includes\/media.php *\/\n\t\t<\/style>\n\t\t<div id='gallery-2' class='gallery galleryid-9370 gallery-columns-3 gallery-size-thumbnail'><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\t<a href='http:\/\/munews.wpengine.com\/alumni-profile-judge-clyde-reese\/reesehomepage\/'><img width=\"150\" height=\"150\" src=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/ReeseHomepage-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/ReeseHomepage-150x150.jpg 150w, http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/ReeseHomepage-130x130.jpg 130w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/a>\n\t\t\t<\/dt><\/dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon portrait'>\n\t\t\t\t<a href='http:\/\/munews.wpengine.com\/alumni-profile-judge-clyde-reese\/judge-reese-web\/'><img width=\"150\" height=\"150\" src=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Judge-Reese-web-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Judge-Reese-web-150x150.jpg 150w, http:\/\/munews.wpengine.com\/wp-content\/uploads\/2018\/03\/Judge-Reese-web-130x130.jpg 130w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/a>\n\t\t\t<\/dt><\/dl>\n\t\t\t<br style='clear: both' \/>\n\t\t<\/div>\n\n","protected":false},"excerpt":{"rendered":"<p>Judge Reese, &#x27;96, took an untraditional path to becoming a judge. After completing his undergraduate degree, he worked in real estate until making the decision to go to law school at the age of 32. He had three small children at the time and wanted to provide better for them as a real estate closing attorney. He decided to attend Mercer Law because of its welcoming environment. “I was determined to be successful at it,” Judge Reese said. “I built an approach that failure was not an option.” And has not looked back since. He was able to continue being [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":9371,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9370"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9370"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9370\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9371"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9370"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9370"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9370"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9317,"date":"2017-10-25T00:00:00","date_gmt":"2017-10-25T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/project-equality-raises-money-for-crisis-line\/"},"modified":"2017-10-25T00:00:00","modified_gmt":"2017-10-25T00:00:00","slug":"project-equality-raises-money-for-crisis-line","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/project-equality-raises-money-for-crisis-line\/","title":{"rendered":"Project Equality Raises $2,800 for Crisis Line and Safe House"},"content":{"rendered":"<p>Project Equality, Mercer Law&#x27;s LGBTQIA student organization, hosted the Second Annual Drag Extravaganza on Oct. 5, 2017, to benefit Crisis Line &amp; Safe House of Central Georgia at the Hummingbird Stage and Taproom. The owner of the Hummingbird, as well as the District Attorney of Macon-Bibb County, matched the fundraising total of the organization. Project Equality raised $2,892 to support the local charity.<\/p>\n<p>Project Equality is Mercer Law&#x27;s LGBTQ+ association, promoting advocacy of queer issues and queer representation in the legal profession.<\/p>\n<p>“LGBT people often face discrimination from safe shelters,” said Project Equality president Sammy D. Hall Jr. “Project Equality supports Crisis Line and Safe House because of their outstanding reputation for supporting all people, regardless of sexual orientation\/identity.”<br \/> The mission of Crisis Line &amp; Safe House of Central Georgia is to provide community crisis intervention as well as safe shelter, comprehensive support, and recovery services for victims of sexual assault and domestic violence, and to educate the community about the cycle of violence and its prevention.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Equality, Mercer Law’s LGBTQIA student organization, hosted the Second Annual Drag Extravaganza on Oct. 5, 2017, to benefit Crisis Line &#038; Safe House of Central Georgia at the Hummingbird Stage and Taproom. The owner of the Hummingbird, as well as the District Attorney of Macon-Bibb County, matched the fundraising total of the organization. Project Equality raised $2,892 to support the local charity.<\/p>\n","protected":false},"author":35,"featured_media":9318,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9317"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9317"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9317\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9318"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9317"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9317"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9317"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9319,"date":"2017-10-25T00:00:00","date_gmt":"2017-10-25T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/career-services-at-mercer-law-for-students-and-alumni\/"},"modified":"2017-10-25T00:00:00","modified_gmt":"2017-10-25T00:00:00","slug":"career-services-at-mercer-law-for-students-and-alumni","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/career-services-at-mercer-law-for-students-and-alumni\/","title":{"rendered":"Career Services at Mercer Law for Students &#038; Alumni"},"content":{"rendered":"<p>One of the easiest ways to engage with the Law School is by reaching back to help law students. But, did you know, the Career Services Office works with alumni on their careers as well? Here are a few ways the Career Services Office assists both current students and alumni:<\/p>\n<p><strong>Hire Mercer!<\/strong> If you have hiring needs, let us know. If you know of hiring needs at organizations other than your own, encourage them to reach out to Mercer, or tell us and we will reach out to them. Can you offer a student experience while he\/she earns externship credit during the fall, spring, or summer (limited generally to government, nonprofit, and corporate counsel placements)? If your organization is hiring or can offer experience for academic credit, contact the Career Services Office through our Recruiting Form on our website at<br \/>\n<a href=\"http:\/\/www.law.mercer.edu\/career\/employers\/\">www.law.mercer.edu\/career\/employers\/<\/a>, via email at<br \/>\n<a href=\"mailto:careerservices@law.mercer.edu\">careerservices@law.mercer.edu<\/a>, or via phone at (478) 301-2615.<br \/>\n<strong>Share Your Expertise<\/strong>! Even if you do not know of opportunities, share your career experiences by having coffee or lunch with a law student over an informational interview, participate in mock interviews, or be willing to speak to students in a class or on a panel about your career. Contact<br \/>\n<a href=\"mailto:careerservices@law.mercer.edu\">careerservices@law.mercer.edu<\/a> if you would like to volunteer.<br \/>\n<strong>Seeking a change<\/strong>? The Career Services Office frequently receives requests for candidate referrals and\/or posts opportunities for employers seeking candidates with at least 2-3 years of experience. As an alumnus, you have access to our job posting system, other job resources, and counseling services. We recently changed from Symplicity to BearBoard (powered by 12Twenty). Find the link to the system at<br \/>\n<a href=\"http:\/\/www.law.mercer.edu\/career\/\">www.law.mercer.edu\/career\/<\/a> and contact us directly for help in establishing an account at<br \/>\n<a href=\"mailto:careerservices@law.mercer.edu\">careerservices@law.mercer.edu<\/a>. &nbsp;BearBoard contains links to other job resources and appointment scheduling if needed.<br \/>\n<strong>Looking to build your business<\/strong>? We frequently receive calls for referrals. Make sure the alumni directory has your current employment information and, if you are on LinkedIn, join our alumni group. If you have a few years of experience, we can help connect you with services like<br \/>\n<a href=\"http:\/\/www.legalspark.com\">www.legalspark.com<\/a>, which works to connect legal consumers with attorneys for discrete one time questions or potential further representation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the easiest ways to engage with the Law School is by reaching back to help law students. But, did you know, the Career Services Office works with alumni on their careers as well? Here are a few ways the Career Services Office assists both current students and alumni.<\/p>\n","protected":false},"author":35,"featured_media":9320,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9319"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9319"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9319\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9320"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9319"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9319"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9319"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9312,"date":"2017-10-18T00:00:00","date_gmt":"2017-10-18T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/awls-giddings-5k\/"},"modified":"2017-10-18T00:00:00","modified_gmt":"2017-10-18T00:00:00","slug":"awls-giddings-5k","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/awls-giddings-5k\/","title":{"rendered":"Mercer Law Association of Women Law Students to Host Inaugural Lauren Giddings 5K"},"content":{"rendered":"<p>The Association of Women Law Students at Mercer University School of Law will host the inaugural Lauren Giddings 5K on Nov. 4 during Mercer&#x27;s Homecoming weekend. The race will take place at the Ocmulgee National Monument in Macon. Registration will begin at 8:30 a.m., and the race will begin at 9 a.m.<\/p>\n<p>The registration fee is $30 if registered by Oct. 20 and $40 after Oct. 20. All race participants will receive a T-shirt. The online registration form can be found at <a href=\"http:\/\/laurengiddings5k.eventbrite.com\/\">laurengiddings5k.eventbrite.com<\/a>. The top-three male finishers and top-three female finishers will receive a medal.<\/p>\n<p>All money raised will go to the newly created Lauren Giddings Scholarship. The scholarship will be awarded to a third-year AWLS member for his or her bar exam expenses. The scholarship recipient will be chosen based on service hours with AWLS and a written essay. Currently, the average amount that law school graduates spend on bar exam preparation and living expenses the summer after they graduate is more than $8,000, and federal loans cover less than half of that amount.<\/p>\n<p>The race and scholarship were named in memory of Lauren Giddings, who graduated from Mercer Law in May 2011. She died June 26, 2011, in Macon at the age of 27. Giddings, a native of Laurel, Maryland, earned her bachelor&#x27;s degree in 2006 from Agnes Scott College, where she studied political science and religious studies and played softball. After graduation, she returned home and worked for the National Center for Public Policy in Washington, D.C., before enrolling in law school in 2008. Giddings served as the president of the Federalist Society, a member of AWLS and a student volunteer with The Habeas Project while at Mercer. She is survived by her parents, Bill and Karen Giddings, and sisters, Sarah Giddings and Kaitlyn Wheeler.<\/p>\n<p>The race and scholarship are organized by AWLS, which is among the largest and most active student organizations at Mercer Law. The organization&#x27;s mission is to promote the advantages and disadvantages women may encounter in the legal profession, to support the advancement of women in the legal profession and to serve the Macon community.<\/p>\n<p>Sponsors of the race include Adams, Jordan and Herrington; Balch and Bingham; Butler Snow; Chambless, Higdon, Richardson, Katz and Griggs; Childers and McCain; Connie Williford Law Offices; Tom and Carolyn Couch; Crucilla Law Firm; Richard Custard; Deadwyler-Heuman Law Firm; Gautreaux Law; Zane Hasty; James Bates; the Mills family; National Federalist Society; Peggy Johnson Hindsman; David Oedel; Powers Law Firm; Reynolds, Horne and Survant; Rubnitz Thompson Ziblut; and Spivey, Pope, Green and Greer.<\/p>\n<p>For more information, contact AWLS Fall Co-Philanthropy Chair Caitlin Wise at <a href=\"mailto:cwise19@lawmail.mercer.edu\">cwise19@lawmail.mercer.edu<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Association of Women Law Students at Mercer University School of Law will host the inaugural Lauren Giddings 5K on Nov. 4 during Mercer’s Homecoming weekend. The race will take place at the Ocmulgee National Monument in Macon. Registration will begin at 8:30 a.m., and the race will begin at 9 a.m.<\/p>\n","protected":false},"author":35,"featured_media":9313,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9312"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9312"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9312\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9313"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9312"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9312"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9312"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9274,"date":"2017-09-19T00:00:00","date_gmt":"2017-09-19T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/court-of-appeals-visit-2017\/"},"modified":"2017-09-19T00:00:00","modified_gmt":"2017-09-19T00:00:00","slug":"court-of-appeals-visit-2017","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/court-of-appeals-visit-2017\/","title":{"rendered":"Court of Appeals to Hold Special Session at Mercer Law School"},"content":{"rendered":"<p>On Tuesday, Oct. 3 at 9:30 a.m. the Court of Appeals&nbsp;of the State of Georgia will hear oral arguments in the first-floor moot courtroom at Mercer Law School. The annual visit will provide an opportunity for students and the local community to observe the Court in action. The panel that will hear cases at the Law School includes Judge M. Yvette Miller, presiding, Judge Sara L. Doyle and Judge Clyde L. Reese. The cases to be heard as part of the Second Division of the Court are listed below.<\/p>\n<p>Judge Miller is a double bear of Mercer, earning her B.A. degree and J.D. from the University. Judge Doyle and Judge Reese are also graduates of Mercer Law School.<\/p>\n<p>At the start of the session, the Court will hold a short admission ceremony allowing any recent law school graduates, alumni or members of the local bar who are not already admitted to the Court of Appeals to be admitted at the special session. If you are interested in being admitted to the Bar of the Court of Appeals of Georgia on October 3, please contact <a href=\"mailto:cadle_l@law.mercer.edu\">Leslie Cadle<\/a> at Mercer Law School for further details.<br \/> &nbsp;<\/p>\n<p><strong><em>A171A1969: Georgia-Pacific Consumer Products, PL v. Kirbi Ratner, et al.<\/em><\/strong><\/p>\n<p>The case involves an appeal of the trial court&#x27;s denial of a motion for summary judgment by the defendant, Georgia-Pacific Consumer Products, in a lawsuit brought by landowners for nuisance and negligence relating to releases of hydrogen sulfide from a Georgia-Pacific paper mill. The issues on appeal focus on statutory interpretation, the scope of duty in negligence, and the availability of punitive damages.<\/p>\n<p><a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A1969-BRIEF-OF-APPELLANT-NT.pdf\">Appellant&#x27;s Brief A171A1969<\/a><br \/>\n<a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A1969-BRIEF-OF-APPELLEE-EE.pdf\">Appellee&#x27;s Brief A171A1969<\/a> <\/p>\n<p><em><strong>A17A1970: Kirbi Ratner, et al. v. Georgia-Pacific Consumer Products, PL<\/strong><\/em><\/p>\n<p>The case, a companion to A171A1969, involves an appeal of the trial court&#x27;s decision to grant Georgia-Pacific Consumer Products&#x27; motion for summary judgment on the trespass claim brought by Kirbi Ratner, et al., relating to the releases of hydrogen sulfide from the defendant&#x27;s paper mill.<\/p>\n<p><a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A1970-BRIEF-OF-APPELLANT-NT.pdf\">Appellant&#x27;s Brief A17A1970<\/a><br \/>\n<a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A1970-BRIEF-OF-APPELLEE-EE.pdf\">Appellee&#x27;s Brief A17A1970<\/a> <\/p>\n<p><em><strong>A171A1726: John F. Davis, et al. v. Louisiana Pacific<\/strong><\/em><\/p>\n<p>The case involves an appeal by John F. Davis of the Georgia Board of Workers&#x27; Compensation decision to dismiss his claim for workers compensation for injuries related to mesothelioma when he was injured in Georgia, but the injuries were caused by asbestos exposure that occurred outside of Georgia.<\/p>\n<p><a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A1726-BRIEF-OF-APPELLANT-NT.pdf\">Appellant&#x27;s Brief A171A1726<\/a><br \/>\n<a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A1726-BRIEF-OF-APPELLEE-EE.pdf\">Appellee&#x27;s Brief A171A1726<\/a> <\/p>\n<p><em><strong>A171A2112: Mary Murray v. Community Health Systems Professional Corp., et al.<\/strong><\/em><\/p>\n<p>The case involves an appeal of the trial court&#x27;s decision to grant the defendants&#x27; motions for summary judgment on the plaintiff&#x27;s claims for defamation and violation of the whistleblower protection provisions of the Georgia Medicaid False Claims Act in a lawsuit relating to her termination as a physician by the defendants.&nbsp;<\/p>\n<p><a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A2112-BRIEF-OF-APPELLANT-NT.pdf\">Appellant&#x27;s Brief A171A2112<\/a><br \/>\n<a href=\"http:\/\/law.mercer.edu\/about\/news\/upload\/A17A2112-BRIEF-OF-APPELLEE-EE.pdf\">Appellee&#x27;s Brief A171A2112<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>On Tuesday, Oct. 3 at 9:30 a.m. the Court of Appeals of the State of Georgia will hear oral arguments in the first-floor moot courtroom at Mercer Law School. The annual visit will provide an opportunity for students and the local community to observe the Court in action. The panel that will hear cases at the Law School includes Judge M. Yvette Miller, presiding, Judge Sara L. Doyle and Judge Clyde L. Reese. The cases to be heard as part of the Second Division of the Court are listed below<\/p>\n","protected":false},"author":35,"featured_media":9275,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9274"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9274"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9274\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9275"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9274"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9274"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9274"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9272,"date":"2017-09-18T00:00:00","date_gmt":"2017-09-18T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/daca-renewal-clinic\/"},"modified":"2017-09-18T00:00:00","modified_gmt":"2017-09-18T00:00:00","slug":"daca-renewal-clinic","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/daca-renewal-clinic\/","title":{"rendered":"Free DACA Renewal Clinic to be held at Mercer Law School"},"content":{"rendered":"<p>Mercer Law School and the law office of Jennifer Moore will host a free clinic for Deferred Action for Childhood Arrivals (DACA) beneficiaries whose current status expires between Sept. 5, 2017, and March 5, 2018, to help these individuals renew their DACA status by the Oct. 5 deadline.<\/p>\n<p>The clinic will take place at the Law School, 1021 Georgia Avenue in Macon, this Saturday, Sept. 23, and Sunday, Sept. 24, from 10 a.m.-4 p.m. each day.<\/p>\n<p>The U.S. federal government is currently only adjudicating DACA renewal requests accepted<i> <\/i>by Oct. 5, 2017, from current beneficiaries whose benefits will expire between Sept. 5, 2017, and March 5, 2018.<\/p>\n<p>This weekend&#x27;s free clinic will help beneficiaries complete the required paperwork necessary to apply for renewal. Individuals can set up an appointment at <a href=\"http:\/\/law.mercer.edu\/daca\">law.mercer.edu\/daca<\/a>, and walk-ins are also welcome.<\/p>\n<p>&nbsp;“There are several DACA Renewal Clinics being offered in Georgia, almost all of them in Atlanta. To our knowledge this is the only one in Middle Georgia. Those of us offering the Clinics feel an obligation to do what we can to help a very deserving and vulnerable part of our community meet a quickly approaching deadline,” said Mark Jones, professor of law and co-organizer of the clinic. “Mercer Law School is committed to teaching our students the value of supporting their local community and giving back whenever possible. This is one way in which our students are truly making a difference in the lives of others.”<\/p>\n<p>Individuals should bring all required paperwork with them to the clinic, including:<\/p>\n<p> Copy of current work authorization card and copy of any old DACA application (if available) $25 for postage and $495 money order for government fees Any criminal records (tickets, citations, certified dispositions, charging documents, police reports) List and records of any contact with immigration agencies If an individual has traveled abroad, a copy of advance parole document and passport used for travel List of addresses since last application Current passport (if available) and photo ID (if available) <\/p>\n<p>Additionally, scholarships may be available for the renewal fee through <a href=\"http:\/\/lc4daca.org\/\">lc4daca.org<\/a>. Individuals must apply for the scholarship before submitting an application.<\/p>\n<p>A representative from the Mexican Consulate will also be on site to provide information about possible financial assistance with government fees.<\/p>\n<p><strong>About the Mercer University School of Law <\/strong><\/p>\n<p>Founded in 1873, Mercer University School of Law is one of the oldest law schools in the United States and the first one in the state of Georgia accredited by the American Bar Association. Mercer Law School&#x27;s educational philosophy is based on a broadly shared commitment to prepare students for the high-quality, general practice of law in a day-to-day learning environment that is both strongly supportive and consistently professional. Its innovative Woodruff Curriculum – which focuses on ethics and practical skills amid small class sizes –twice earned the Gambrell Professionalism Award from the ABA for its “depth of excellence.” With an enrollment of about 375 students, Mercer Law School is nationally recognized for its exceptional programs in legal writing, moot court, experiential education, and ethics and professionalism. For more information about Mercer Law School, visit <a href=\"http:\/\/law.mercer.edu\/\">law.mercer.edu<\/a> or call (478) 301-5000.<\/p>\n<p><strong>About the Law Office of Jennifer Moore<\/strong><\/p>\n<p>Jennifer Moore&#x27;s law office is located in Macon, Georgia since being admitted to the State Bar of Georgia in 2010. &nbsp;Her practice focuses on removal defense and family based immigration. Ms. Moore has a strong commitment to providing pro bono services when necessary. For more information about Jennifer Moore, visit <a href=\"https:\/\/jenniferatlaw.com\/\">jenniferatlaw.com<\/a> or call (478) 714-6739.<\/p>\n<p>&#8211;30&#8211;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mercer Law School and the law office of Jennifer Moore will host a free clinic for Deferred Action for Childhood Arrivals (DACA) beneficiaries whose current status expires between Sept. 5, 2017, and March 5, 2018, to help these individuals renew their DACA status by the Oct. 5 deadline.<br \/>\nThe clinic will take place at the Law School, 1021 Georgia Avenue in Macon, this Saturday, Sept. 23, and Sunday, Sept. 24, from 10 a.m.-4 p.m. each day.<\/p>\n","protected":false},"author":35,"featured_media":9273,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9272"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9272"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9272\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9273"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9272"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9272"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9272"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9250,"date":"2017-08-31T00:00:00","date_gmt":"2017-08-31T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/2017-law-review-symposium\/"},"modified":"2017-08-31T00:00:00","modified_gmt":"2017-08-31T00:00:00","slug":"2017-law-review-symposium","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/2017-law-review-symposium\/","title":{"rendered":"2017 Law Review Symposium on Disruptive Innovation in Criminal Defense"},"content":{"rendered":"<p>The 2017 Law Review Symposium to be held on Friday, Oct. 6, will focus on “Disruptive Innovation in Criminal Defense.” It is sponsored by the Law Review, Mercer School of Law, and the Southeastern Association of Law Schools. The symposium will take place in the first-floor moot courtroom of Mercer Law School from 9:00 a.m. &#8211; 4:45 p.m. It is free and open to the public.<\/p>\n<p><strong>The symposium has been approved for 6 CLE hours, including 1 ethics hour. <\/strong>Registration for the CLE will begin at 8 a.m. The cost is $75 and must be paid by check or money order.<\/p>\n<p>The symposium explores existing and imaginable innovations in criminal defense that would depart from, and ideally disrupt, conventional ways of doing things. The speakers were invited to examine and propose innovations in individual representations, in the broad-scale delivery of legal services, and at other levels. In other words, this Symposium asks what can be done differently that will make a difference in criminal defense. Additionally, it explores the legal, political and other barriers to innovation. Finally, the Symposium considers the implications of this inquiry for teaching and scholarship.<\/p>\n<p>According to the Mercer faculty liaison for the Symposium, Gary Simson, Senior Vice Provost for Scholarship and Macon Chair in Law, “The speakers are an all-star lineup of criminal procedure and legal ethics scholars, with a wealth of practice experience between them in criminal justice. At this year&#x27;s Southeastern Association of Law Schools conference, I heard the speakers give a preview of the talks they will be delivering here. They were outstanding, and I am confident that the Symposium will be among the very best the Law Review has ever done.”<\/p>\n<p>The day begins with a welcome from Dean Cathy Cox at 9 a.m. followed by first session of the symposium, 9:15 a.m. &#8211; 10:30 a.m., featuring two speakers: Bruce Green, “The Right to Two Criminal Defense Lawyer” and Steven Zeidman, “Raising the Bar: Indigent Defense and The Right to a Partisan Lawyer.”<\/p>\n<p>Green is the Louis Stein Chair at Fordham Law School, where he directs the Louis Stein Center for Law and Ethics. Zeidman is a Professor of Law at CUNY School of Law where he is director of the Criminal Defense Clinic.<\/p>\n<p>The second session, from 10:45 a.m. &#8211; Noon, includes Ellen Podgor on “Disruptive Innovation in Criminal Defense: Demanding Corporate Criminal Trials” and David Singleton on “Serving Two Masters: The Role Defense Counsel Can Play in Pursuing Restorative Justice Remedies That Serve Both the Wrongdoer and the Crime Survivor.”<\/p>\n<p>Podgor is the Gary R. Trombley Family and White Collar Crime Research Professor at Stetson School of Law where she teaches in the areas of white collar crime, criminal law and international criminal law. Singleton is a professor at Northern Kentucky School of Law where he is Director of Constitutional Litigation Clinic.<\/p>\n<p>Following a break for lunch is the third session, 1:30 p.m. – 3:00 p.m, featuring Laurie Levenson on “Politics of Ethics” and Janet Moore on “Cone of Silence: Ethics and Empirical Research on Public Defense.”<\/p>\n<p>Levenson is the David W. Burcham Chair in Ethical Advocacy at Loyola School of Law. Moore is an Associate Professor of Law at the University of Cincinnati College of Law.<\/p>\n<p>The closing session, from 3:15 p.m. &#8211; 4:30 p.m., will feature Susan Klein and Elissa Steglich, “The Impropriety of Federal Immigration Waivers in Plea Agreements: A Caution to Defense Attorneys” and Donald Tibbs, “Let Them Speak: Paradigms from the Black Power Era as Disruptive Innovation in Criminal Defense.”<\/p>\n<p>Klein is the Alice McKean Young Regents Chair in Law at the University of Texas School of Law, and Steglich is a professor in the Immigration Clinic there. Tibbs is a professor at the Drexel University Thomas R. Kline School of Law.<\/p>\n<p> Additional experts in their respective fields of criminal law will serve as commentators to the speakers and their presentations. Commentators include <a href=\"https:\/\/law.mercer.edu\/faculty\/directory\/gerwig-moore\/\">Professor Sarah Gerwig-Moore<\/a>, <a href=\"https:\/\/www.troutman.com\/david_chaiken\/\">David Chaiken<\/a>, <a href=\"https:\/\/law.mercer.edu\/faculty\/directory\/fleissner\/\">Professor Jim Fleissner<\/a> and <a href=\"https:\/\/www.linkedin.com\/in\/verda-colvin-827982ab\/\">Judge Verda Colvin<\/a>.<\/p>\n<p>Read more about the speakers here:<\/p>\n<p><a href=\"https:\/\/www.fordham.edu\/info\/23140\/bruce_green\"><strong>Professor Bruce Green<\/strong><\/a><\/p>\n<p>Fordham University School of Law<\/p>\n<p><a href=\"https:\/\/law.utexas.edu\/faculty\/susan-r-klein\/\"><strong>Susan Klein<\/strong><\/a><\/p>\n<p>University of Texas School of Law<\/p>\n<p><a href=\"http:\/\/www.lls.edu\/faculty\/facultylistl-r\/levensonlaurie\/\"><strong>Laurie Levenson<\/strong><\/a><\/p>\n<p>Loyola Law School, Los Angeles<\/p>\n<p><a href=\"https:\/\/www.law.uc.edu\/faculty-staff\/faculty\/janet-moore\"><strong>Janet Moore<\/strong><\/a><\/p>\n<p>University of Cincinnati College of Law<\/p>\n<p><a href=\"http:\/\/www.stetson.edu\/law\/faculty\/podgor-ellen-s\/\"><strong>Ellen Podgor<\/strong><\/a><\/p>\n<p>Stetson University College of Law<\/p>\n<p><a href=\"http:\/\/chaselaw.nku.edu\/faculty\/Faculty\/DavidASingleton.html\"><strong>David Singleton<\/strong><\/a><\/p>\n<p>NKU Chase College of Law<\/p>\n<p><strong><a href=\"https:\/\/law.utexas.edu\/faculty\/elissa-c-steglich\/\">Elissa Steglich<\/a><\/strong><\/p>\n<p>University of Texas School of Law<\/p>\n<p><a href=\"http:\/\/drexel.edu\/law\/faculty\/fulltime_fac\/Donald%20Tibbs\/\"><strong>Donald Tibbs<\/strong><\/a><\/p>\n<p>Drexe; University Thomas R. Kline School of Law<\/p>\n<p><a href=\"http:\/\/www.law.cuny.edu\/faculty\/directory\/zeidman.html\"><strong>Steven Zeidman<\/strong><\/a><\/p>\n<p>CUNY School of Law<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 2017 Law Review Symposium to be held on Friday, Oct. 6, will focus on “Disruptive Innovation in Criminal Defense.” It is sponsored by the Law Review, Mercer School of Law, and the Southeast Association of Law Schools. The symposium will take place in the first-floor moot courtroom of Mercer Law School from 9:00 a.m. &#8211; 4:45 p.m. It is free and open to the public.<\/p>\n","protected":false},"author":35,"featured_media":9251,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9250"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9250"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9250\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9251"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9250"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9250"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9250"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":9239,"date":"2017-08-18T00:00:00","date_gmt":"2017-08-18T00:00:00","guid":{"rendered":"http:\/\/munews.wpengine.com\/intro-week-2017\/"},"modified":"2017-08-18T00:00:00","modified_gmt":"2017-08-18T00:00:00","slug":"intro-week-2017","status":"publish","type":"post","link":"http:\/\/munews.wpengine.com\/intro-week-2017\/","title":{"rendered":"Students Return for an Introductory Week to Sharpen Practical Skills"},"content":{"rendered":"<p>This week, Mercer Law students completed their first course of the year during Intro Week, which takes place the week following Orientation, but before classes start. This is an intensive one-week course aimed to sharpen their legal skills before the fall semester starts.&nbsp;<\/p>\n<p>Incoming first-year students are welcomed with an Introduction to Law course. Five experienced professors work with the students over eight class meetings to introduce the tools of legal analysis, such as critical reading, case synthesis, and statutory analysis. The course also showcases the dynamic nature of the law school classroom. Students construct case briefs, explore note-taking strategies and engage in lively discussions throughout the week. Introduction to Law is coordinated by Professor Karen Sneddon, who explains that the course is meant to help prepare each student for success in his or her first semester of law school.<\/p>\n<p>Second-year students complete a simulation-based course called Introduction to Client Counseling. Students watch client counseling demonstrations, take part in a variety of client counseling simulations&nbsp;and build skills through self-reflection and constructive critique. The course culminates in a final exam during which teams of students participate in a simulated counseling session with a local actor portraying the client.<\/p>\n<p>Professor Sarah Gerwig-Moore describes the need for such an experience, stating, &#8220;Clients are at the heart of our work, and&nbsp;I&nbsp;love seeing students confront the barriers to open and productive client counseling and conversation. This skill is central to what almost all lawyers do, and&nbsp;I&#x27;m proud to teach in a law school environment where it is a major focus.&#8221;<\/p>\n<p>Third-year students complete a course in alternative dispute resolution (ADR), which exposes them to various forms of dispute resolution techniques, including negotiation, mediation and arbitration as students enter the final year of their legal education and begin to transition into practice. The course includes a plenary session that exposes students to faculty members and lawyers with extensive practical experience in negotiation, arbitration or mediation and who illustrate integrating dispute resolution skills into practice. Then during the week, students break out into small sections comprised of topical lectures, class discussions and work assignments, with assigned reading and projects in the evening. After the initial exposure to experts in the field and classroom instruction, students participate in a significant number of role-play and simulation exercises designed to integrate the daily reading materials and skills with practical, first-hand applications. The simulations place students in the roles of mediators, arbitrators, or negotiators, as well as the clients they serve, allowing students to become sensitive to the unique issues involved in each role.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This week, Mercer Law students completed their first course of the year during Intro Week, which takes place the week following Orientation, but before classes start. This is an intensive one-week course aimed to sharpen their legal skills before the fall semester starts.&nbsp; Incoming first-year students are welcomed with an Introduction to Law course. Five experienced professors work with the students over eight class meetings to introduce the tools of legal analysis, such as critical reading, case synthesis, and statutory analysis. The course also showcases the dynamic nature of the law school classroom. Students construct case briefs, explore note-taking strategies [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":9240,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9239"}],"collection":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/comments?post=9239"}],"version-history":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/posts\/9239\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media\/9240"}],"wp:attachment":[{"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/media?parent=9239"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/categories?post=9239"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/munews.wpengine.com\/wp-json\/wp\/v2\/tags?post=9239"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}]